In [1]:
#creating a named list
cars <- list(name = "Swift",
             year = 2012,
             type = c("Hatchback", "Adventure", "Efficiency"))

In [2]:
#calling the list
cars

$name
[1] "Swift"

$year
[1] 2012

$type
[1] "Hatchback"  "Adventure"  "Efficiency"

In [3]:
#checking the type of cars
cars$type

[1] "Hatchback"  "Adventure"  "Efficiency"

In [4]:
#selecting items 2 to 3 as an array
cars[2:3]

$year
[1] 2012

$type
[1] "Hatchback"  "Adventure"  "Efficiency"

In [5]:
#calling the type of object
class(cars$name)
class(cars$foreign)

[1] "character"

[1] "NULL"

In [6]:
#adding a new element
cars[["cylinders"]] <- 6
cars

$name
[1] "Swift"

$year
[1] 2012

$type
[1] "Hatchback"  "Adventure"  "Efficiency"

$cylinders
[1] 6

In [7]:
#Modifying the elements
cars[["cylinders"]] <-2
cars

$name
[1] "Swift"

$year
[1] 2012

$type
[1] "Hatchback"  "Adventure"  "Efficiency"

$cylinders
[1] 2

In [8]:
#removing the elements
cars[["cylinders"]] <-NULL
cars

$name
[1] "Swift"

$year
[1] 2012

$type
[1] "Hatchback"  "Adventure"  "Efficiency"

In [9]:
#Concatination
cars1 <- list(name="Bugatti Chiron")
cars2 <- list(year= 2018, attributes=c("two door", "fast", "aggeressive"))

cars_concat <- c(cars1,cars2)

cars_concat

$name
[1] "Bugatti Chiron"

$year
[1] 2018

$attributes
[1] "two door"    "fast"        "aggeressive"

In [10]:
#Data frame

cars <- data.frame(name = c("Jeep", "Renault", "BMW", "Merc",
                              "VW", "Maruti", "Audi", "Tata"),
                    year = c(2005, 2008, 2012, 2016, 2013, 2001, 2007, 2022),
                    stringsAsFactors=F)

In [11]:
cars

  name    year
1 Jeep    2005
2 Renault 2008
3 BMW     2012
4 Merc    2016
5 VW      2013
6 Maruti  2001
7 Audi    2007
8 Tata    2022

In [12]:
#calling the first column
cars[1]

  name
1 Jeep
2 Renault
3 BMW
4 Merc
5 VW
6 Maruti
7 Audi
8 Tata

In [13]:
#calling the car names
cars$name

[1] "Jeep"    "Renault" "BMW"     "Merc"    "VW"      "Maruti"  "Audi"
[8] "Tata"

In [14]:
#Calling info about the dataframe
str(cars)

'data.frame':	8 obs. of  2 variables:
 $ name: chr  "Jeep" "Renault" "BMW" "Merc" ...
 $ year: num  2005 2008 2012 2016 2013 ...

In [15]:
#Calling type of data
class(cars$year)

[1] "numeric"

In [16]:
#calling first few rows of dataframe
head(cars)

  name    year
1 Jeep    2005
2 Renault 2008
3 BMW     2012
4 Merc    2016
5 VW      2013
6 Maruti  2001

In [17]:
#calling last few rows of dataframe
tail(cars)

  name   year
3 BMW    2012
4 Merc   2016
5 VW     2013
6 Maruti 2001
7 Audi   2007
8 Tata   2022

In [18]:
cars['type'] <- c("Off Road","Rally","Drift","Lux","Durability","Value","Smooth","Raw")
cars

  name    year type
1 Jeep    2005 Off Road
2 Renault 2008 Rally
3 BMW     2012 Drift
4 Merc    2016 Lux
5 VW      2013 Durability
6 Maruti  2001 Value
7 Audi    2007 Smooth
8 Tata    2022 Raw

In [19]:
#adding a new row
cars <- rbind(cars, c(name="Toyota", year=1980, type="Race"))
cars

  name    year type
1 Jeep    2005 Off Road
2 Renault 2008 Rally
3 BMW     2012 Drift
4 Merc    2016 Lux
5 VW      2013 Durability
6 Maruti  2001 Value
7 Audi    2007 Smooth
8 Tata    2022 Raw
9 Toyota  1980 Race

In [21]:
#delete a row tata
cars <- cars[-8,]
cars

  name    year type
1 Jeep    2005 Off Road
2 Renault 2008 Rally
3 BMW     2012 Drift
4 Merc    2016 Lux
5 VW      2013 Durability
6 Maruti  2001 Value
7 Audi    2007 Smooth
9 Toyota  1980 Race

In [22]:
#deleting the column type
cars[["type"]]<- NULL
cars

  name    year
1 Jeep    2005
2 Renault 2008
3 BMW     2012
4 Merc    2016
5 VW      2013
6 Maruti  2001
7 Audi    2007
9 Toyota  1980